app/controllers/admin/projects_controller.rb

  def create
    @project = Project.new(project_params)
    if @project.save
---
INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "test"], ["link", "test"], ["created_at", "2023-05-23 12:31:05.647655"], ["updated_at", "2023-05-23 12:31:05.647655"]]

  def update
    if @project.update(project_params)
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "本專案使用 Python 程式語言，利用 Selenium 套件進行網路爬蟲，透過 ChromeDriver 開啟 POPCAT 網站並自動執行點擊指令。 "], ["updated_at", "2023-04-17 08:56:35.639010"], ["id", 3]]